app/helpers/application_helper.rb

SELECT "product_categories".* FROM "product_categories"
---
  def product_category_list
    ProductCategory.all.map {|pro_cat| [pro_cat.name, pro_cat.id]}