app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @search = Product.search(params[:q])

INSERT INTO "products" ("name", "description", "product_category_id", "is_active", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", ""], ["description", ""], ["product_category_id", 8], ["is_active", 1], ["status", ""], ["created_at", "2018-12-25 09:31:29.579967"], ["updated_at", "2018-12-25 09:31:29.579967"]]
---
  def create
    @product = Product.new(product_params)
    if @product.save