app/controllers/product_categories_controller.rb

  def edit
    @product_category = ProductCategory.find(params[:id])
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def show
    @product_category = ProductCategory.find(params[:id])
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @product_category = ProductCategory.new(product_cat_params)
    @product_category.save
---
INSERT INTO "product_categories" ("name", "description", "cover_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "dsf"], ["description", "sdf"], ["cover_image", "sampleln.png"], ["created_at", "2018-12-20 12:18:02.363902"], ["updated_at", "2018-12-20 12:18:02.363902"]]

  def  update
    @product_category = ProductCategory.find(params[:id])
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def index
    @product_categories = ProductCategory.all
---
SELECT "product_categories".* FROM "product_categories"

  def destroy
    @product_category = ProductCategory.find(params[:id])
    @product_category.destroy
---
SELECT  "product_categories".* FROM "product_categories" WHERE "product_categories"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
DELETE FROM "product_categories" WHERE "product_categories"."id" = ?  [["id", 1]]